pyocd/pyOCD/pyocd/debug/svd/data/LPC11Uxx_v7.svd
			</field>																				
		</fields>																					
	</register>																						
	<register>																						
		<name>PIO0_22</name>																					
		<description>I/O configuration for pin PIO0_22/AD6/CT16B1_MAT1/MISO1</description>																					
		<addressOffset>0x058</addressOffset>																					
		<access>read-write</access>																					
		<resetValue>0x00000090</resetValue>																					
		<resetMask>0xFFFFFFFF</resetMask>																					
		<fields>																					
			<field>																				
				<name>FUNC</name>																			
				<description>Selects pin function. Values 0x4 to 0x7 are reserved.</description>																			
				<bitRange>[2:0]</bitRange>																			
																							
				<enumeratedValues>																			
				<name>ENUM</name>																			
																							
					<enumeratedValue>																		
						<name>PIO0_22_</name>																	
						<description>PIO0_22.</description>																	
						<value>0x0</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>AD6_</name>																	
						<description>AD6.</description>																	
						<value>0x1</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>CT16B1_MAT1_</name>																	
						<description>CT16B1_MAT1.</description>																	
						<value>0x2</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>MISO1_</name>																	
						<description>MISO1.</description>																	
						<value>0x3</value>																	
					</enumeratedValue>																		
				</enumeratedValues>																			
			</field>																				
			<field>																				
				<name>MODE</name>																			
				<description>Selects function mode (on-chip pull-up/pull-down resistor control).</description>																			
				<bitRange>[4:3]</bitRange>																			
																							
				<enumeratedValues>																			
				<name>ENUM</name>																			
																							
					<enumeratedValue>																		
						<name>INACTIVE_NO_PULL_DO</name>																	
						<description>Inactive (no pull-down/pull-up resistor enabled).</description>																	
						<value>0x0</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>PULL_DOWN_RESISTOR_E</name>																	
						<description>Pull-down resistor enabled.</description>																	
						<value>0x1</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>PULL_UP_RESISTOR_ENA</name>																	
						<description>Pull-up resistor enabled.</description>																	
						<value>0x2</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>REPEATER_MODE_</name>																	
						<description>Repeater mode.</description>																	
						<value>0x3</value>																	
					</enumeratedValue>																		
				</enumeratedValues>																			
			</field>																				
			<field>																				
				<name>HYS</name>																			
				<description>Hysteresis.</description>																			
				<bitRange>[5:5]</bitRange>																			
																							
				<enumeratedValues>																			
				<name>ENUM</name>																			
																							
					<enumeratedValue>																		
						<name>DISABLE_</name>																	
						<description>Disable.</description>																	
						<value>0</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>ENABLE_</name>																	
						<description>Enable.</description>																	
						<value>1</value>																	
					</enumeratedValue>																		
				</enumeratedValues>																			
			</field>																				
			<field>																				
				<name>INV</name>																			
				<description>Invert input</description>																			
				<bitRange>[6:6]</bitRange>																			
																							
				<enumeratedValues>																			
				<name>ENUM</name>																			
																							
					<enumeratedValue>																		
						<name>INPUT_NOT_INVERTED_</name>																	
						<description>Input not inverted (HIGH on pin reads as 1, LOW on pin reads as 0).</description>																	
						<value>0</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>INPUT_INVERTED_HIGH</name>																	
						<description>Input inverted (HIGH on pin reads as 0, LOW on pin reads as 1).</description>																	
						<value>1</value>																	
					</enumeratedValue>																		
				</enumeratedValues>																			
			</field>																				
			<field>																				
				<name>ADMODE</name>																			
				<description>Selects Analog/Digital mode.</description>																			
				<bitRange>[7:7]</bitRange>																			
																							
				<enumeratedValues>																			
				<name>ENUM</name>																			
																							
					<enumeratedValue>																		
						<name>ANALOG_INPUT_MODE_</name>																	
						<description>Analog input mode.</description>																	
						<value>0</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>DIGITAL_FUNCTIONAL_M</name>																	
						<description>Digital functional mode.</description>																	
						<value>1</value>																	
					</enumeratedValue>																		
				</enumeratedValues>																			
			</field>																				
			<field>																				
				<name>FILTR</name>																			
				<description>Selects 10 ns input glitch filter.</description>																			
				<bitRange>[8:8]</bitRange>																			
																							
				<enumeratedValues>																			
				<name>ENUM</name>																			
																							
					<enumeratedValue>																		
						<name>FILTER_ENABLED_</name>																	
						<description>Filter enabled.</description>																	
						<value>0</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>FILTER_DISABLED_</name>																	
						<description>Filter disabled.</description>																	
						<value>1</value>																	
					</enumeratedValue>																		
				</enumeratedValues>																			
			</field>																				
			<field>																				
				<name>RESERVED</name>																			
				<description>Reserved.</description>																			
				<bitRange>[9:9]</bitRange>																			
																							
																		
