pyocd/pyOCD/pyocd/debug/svd/data/LPC11Uxx_v7.svd
			</field>			
		</fields>				
	</register>					
	<register>					
		<name>SYSPLLCLKSEL</name>				
		<description>System PLL clock source select</description>				
		<addressOffset>0x040</addressOffset>				
		<access>read-write</access>				
		<resetValue>0x1</resetValue>				
		<resetMask>0xFFFFFFFF</resetMask>				
		<fields>				
			<field>			
				<name>SEL</name>		
				<description>System PLL clock source</description>		
				<bitRange>[1:0]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>IRC</name>
						<description>IRC</description>
						<value>0x0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>CRYSTAL_OSCILLATOR_</name>
						<description>Crystal Oscillator (SYSOSC)</description>
						<value>0x1</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>RESERVED</name>
						<description>Reserved</description>
						<value>0x2</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>RESERVED</name>
						<description>Reserved</description>
						<value>0x3</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>RESERVED</name>		
				<description>Reserved</description>		
				<bitRange>[31:2]</bitRange>		

			</field>			
		</fields>				
	</register>					
	<register>					
		<name>SYSPLLCLKUEN</name>				
		<description>System PLL clock source update enable</description>				
		<addressOffset>0x044</addressOffset>				
		<access>read-write</access>				
		<resetValue>0x1</resetValue>				
		<resetMask>0xFFFFFFFF</resetMask>				
		<fields>				
			<field>			
				<name>ENA</name>		
				<description>Enable system PLL clock source update</description>		
				<bitRange>[0:0]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>NO_CHANGE</name>
						<description>No change</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>UPDATE_CLOCK_SOURCE</name>
						<description>Update clock source</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>RESERVED</name>		
				<description>Reserved</description>		
				<bitRange>[31:1]</bitRange>		

			</field>			
		</fields>				
	</register>					
	<register>					
		<name>USBPLLCLKSEL</name>				
		<description>USB PLL clock source select</description>				
		<addressOffset>0x048</addressOffset>				
		<access>read-write</access>				
		<resetValue>0</resetValue>				
		<resetMask>0xFFFFFFFF</resetMask>				
		<fields>				
			<field>			
				<name>SEL</name>		
				<description>USB PLL clock source</description>		
				<bitRange>[1:0]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>IRC_THE_USB_PLL_CLO</name>
						<description>IRC. The USB PLL clock source must be switched to system oscillator for correct full-speed USB operation. The IRC is suitable for low-speed USB operation.</description>
						<value>0x0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>SYSTEM_OSCILLATOR</name>
						<description>System oscillator</description>
						<value>0x1</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>RESERVED</name>
						<description>Reserved</description>
						<value>0x2</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>RESERVED</name>
						<description>Reserved</description>
						<value>0x3</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>RESERVED</name>		
				<description>Reserved</description>		
				<bitRange>[31:2]</bitRange>		

			</field>			
		</fields>				
	</register>					
	<register>					
		<name>USBPLLCLKUEN</name>				
		<description>USB PLL clock source update enable</description>				
		<addressOffset>0x04C</addressOffset>				
		<access>read-write</access>				
		<resetValue>0</resetValue>				
		<resetMask>0xFFFFFFFF</resetMask>				
		<fields>				
			<field>			
				<name>ENA</name>		
				<description>Enable USB PLL clock source update</description>		
				<bitRange>[0:0]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>NO_CHANGE</name>
						<description>No change</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>UPDATE_CLOCK_SOURCE</name>
						<description>Update clock source</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>RESERVED</name>		
				<description>Reserved</description>		
				<bitRange>[31:1]</bitRange>		

			</field>			
		</fields>				
	</register>					
	<register>					
		<name>MAINCLKSEL</name>				
		<description>Main clock source select</description>				
		<addressOffset>0x070</addressOffset>				
		<access>read-write</access>				
		<resetValue>0x0</resetValue>				
		<resetMask>0xFFFFFFFF</resetMask>				
		<fields>				
			<field>			
				<name>SEL</name>		
				<description>Clock source for main clock</description>		
				<bitRange>[1:0]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>IRC_OSCILLATOR</name>
						<description>IRC Oscillator</description>
						<value>0x0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>PLL_INPUT</name>
						<description>PLL input</description>
						<value>0x1</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>WATCHDOG_OSCILLATOR</name>
						<description>Watchdog oscillator</description>
						<value>0x2</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>PLL_OUTPUT</name>
						<description>PLL output</description>
						<value>0x3</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>RESERVED</name>		
				<description>Reserved</description>		
				<bitRange>[31:2]</bitRange>		

