pyocd/pyOCD/pyocd/debug/svd/data/LPC11Uxx_v7.svd
			</field>			
		</fields>				
	</register>					
	<register>					
		<name>SYSTCKCAL</name>				
		<description>System tick counter calibration</description>				
		<addressOffset>0x154</addressOffset>				
		<access>read-write</access>				
		<resetValue>0x4</resetValue>				
		<resetMask>0xFFFFFFFF</resetMask>				
		<fields>				
			<field>			
				<name>CAL</name>		
				<description>System tick timer calibration value</description>		
				<bitRange>[25:0]</bitRange>		
			</field>			
			<field>			
				<name>RESERVED</name>		
				<description>Reserved</description>		
				<bitRange>[31:26]</bitRange>		
			</field>			
		</fields>				
	</register>					
	<register>					
		<name>IRQLATENCY</name>				
		<description>IQR delay. Allows trade-off between interrupt latency and determinism.</description>				
		<addressOffset>0x170</addressOffset>				
		<access>read-write</access>				
		<resetValue>0x00000010</resetValue>				
		<resetMask>0xFFFFFFFF</resetMask>				
		<fields>				
			<field>			
				<name>LATENCY</name>		
				<description>8-bit latency value</description>		
				<bitRange>[7:0]</bitRange>		
			</field>			
			<field>			
				<name>RESERVED</name>		
				<description>Reserved</description>		
				<bitRange>[31:8]</bitRange>		
			</field>			
		</fields>				
	</register>					
	<register>					
		<name>NMISRC</name>				
		<description>NMI Source Control</description>				
		<addressOffset>0x174</addressOffset>				
		<access>read-write</access>				
		<resetValue>0</resetValue>				
		<resetMask>0xFFFFFFFF</resetMask>				
		<fields>				
			<field>			
				<name>IRQNO</name>		
				<description>The IRQ number of the interrupt that acts as the Non-Maskable Interrupt (NMI) if bit 31 is 1. See Table 58 for the list of interrupt sources and their IRQ numbers.</description>		
				<bitRange>[4:0]</bitRange>		
			</field>			
			<field>			
				<name>RESERVED</name>		
				<description>Reserved</description>		
				<bitRange>[30:5]</bitRange>		
			</field>			
			<field>			
				<name>NMIEN</name>		
				<description>Write a 1 to this bit to enable the Non-Maskable Interrupt (NMI) source selected by bits 4:0.</description>		
				<bitRange>[31:31]</bitRange>		
			</field>			
		</fields>				
	</register>					
	<register>					
		<dim>8</dim>				
		<dimIncrement>0x4</dimIncrement>				
		<dimIndex>0-7</dimIndex>				
		<name>PINTSEL%s</name>				
		<description>GPIO Pin Interrupt Select register 0</description>				
		<addressOffset>0x178</addressOffset>				
		<access>read-write</access>				
		<resetValue>0</resetValue>				
		<resetMask>0xFFFFFFFF</resetMask>				
		<fields>				
			<field>			
				<name>INTPIN</name>		
				<description>Pin number select for pin interrupt. (PIO0_0 to PIO0_23 correspond to numbers 0 to 23 and PIO1_0 to PIO1_31 correspond to numbers 24 to 55).</description>		
				<bitRange>[5:0]</bitRange>		
			</field>			
			<field>			
				<name>RESERVED</name>		
				<description>Reserved</description>		
				<bitRange>[31:6]</bitRange>		
			</field>			
		</fields>				
	</register>					
	<register>					
		<name>USBCLKCTRL</name>				
		<description>USB clock control</description>				
		<addressOffset>0x198</addressOffset>				
		<access>read-write</access>				
		<resetValue>0x0</resetValue>				
		<resetMask>0xFFFFFFFF</resetMask>				
		<fields>				
			<field>			
				<name>AP_CLK</name>		
				<description>USB need_clock signal control</description>		
				<bitRange>[0:0]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>UNDER_HARDWARE_CONTR</name>
						<description>Under hardware control.</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>FORCED_HIGH_</name>
						<description>Forced HIGH.</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>POL_CLK</name>		
				<description>USB need_clock polarity for triggering the USB wake-up interrupt</description>		
				<bitRange>[1:1]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>FALLING_EDGE_OF_THE_</name>
						<description>Falling edge of the USB need_clock triggers the USB wake-up (default).</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>RISING_EDGE_OF_THE_U</name>
						<description>Rising edge of the USB need_clock triggers the USB wake-up.</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>RESERVED</name>		
				<description>Reserved</description>		
				<bitRange>[31:2]</bitRange>		

			</field>			
		</fields>				
	</register>					
	<register>					
		<name>USBCLKST</name>				
		<description>USB clock status</description>				
		<addressOffset>0x19C</addressOffset>				
		<access>read-only</access>				
		<resetValue>0x1</resetValue>				
		<resetMask>0xFFFFFFFF</resetMask>				
		<fields>				
			<field>			
				<name>NEED_CLKST</name>		
				<description>USB need_clock signal status</description>		
				<bitRange>[0:0]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>LOW</name>
						<description>LOW</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>HIGH</name>
						<description>HIGH</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>RESERVED</name>		
				<description>Reserved</description>		
				<bitRange>[31:1]</bitRange>		

			</field>			
		</fields>				
	</register>					
	<register>					
		<name>STARTERP0</name>				
		<description>Start logic 0 interrupt wake-up enable register 0</description>				
		<addressOffset>0x204</addressOffset>				
		<access>read-write</access>				
		<resetValue>0</resetValue>				
		<resetMask>0xFFFFFFFF</resetMask>				
		<fields>				
			<field>			
				<name>PINT0</name>		
				<description>Pin interrupt 0 wake-up</description>		
				<bitRange>[0:0]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>DISABLED</name>
						<description>Disabled</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>ENABLED</name>
						<description>Enabled</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>PINT1</name>		
				<description>Pin interrupt 1 wake-up</description>		
				<bitRange>[1:1]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>DISABLED</name>
						<description>Disabled</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>ENABLED</name>
						<description>Enabled</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>PINT2</name>		
				<description>Pin interrupt 2 wake-up</description>		
				<bitRange>[2:2]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>DISABLED</name>
						<description>Disabled</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>ENABLED</name>
						<description>Enabled</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>PINT3</name>		
				<description>Pin interrupt 3 wake-up</description>		
				<bitRange>[3:3]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>DISABLED</name>
						<description>Disabled</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>ENABLED</name>
						<description>Enabled</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>PINT4</name>		
				<description>Pin interrupt 4 wake-up</description>		
				<bitRange>[4:4]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>DISABLED</name>
						<description>Disabled</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>ENABLED</name>
						<description>Enabled</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>PINT5</name>		
				<description>Pin interrupt 5 wake-up</description>		
				<bitRange>[5:5]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>DISABLED</name>
						<description>Disabled</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>ENABLED</name>
						<description>Enabled</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>PINT6</name>		
				<description>Pin interrupt 6 wake-up</description>		
				<bitRange>[6:6]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>DISABLED</name>
						<description>Disabled</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>ENABLED</name>
						<description>Enabled</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>PINT7</name>		
				<description>Pin interrupt 7 wake-up</description>		
				<bitRange>[7:7]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>DISABLED</name>
						<description>Disabled</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>ENABLED</name>
						<description>Enabled</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>RESERVED</name>		
				<description>Reserved</description>		
				<bitRange>[31:8]</bitRange>		

