pyocd/pyOCD/pyocd/debug/svd/data/LPC11Uxx_v7.svd
			</field>			
			<field>			
				<name>USBPAD_PD</name>		
				<description>USB transceiver power-down configuration</description>		
				<bitRange>[10:10]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>USB_TRANSCEIVER_POWE</name>
						<description>USB transceiver powered</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>USB_TRANSCEIVER_POWE</name>
						<description>USB transceiver powered down (suspend mode)</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>RESERVED</name>		
				<description>Reserved. Always write this bit as 1.</description>		
				<bitRange>[11:11]</bitRange>		

			</field>			
			<field>			
				<name>RESERVED</name>		
				<description>Reserved.  Always write this bit as 0.</description>		
				<bitRange>[12:12]</bitRange>		

			</field>			
			<field>			
				<name>RESERVED</name>		
				<description>Reserved. Always write these bits as 111.</description>		
				<bitRange>[15:13]</bitRange>		

			</field>			
			<field>			
				<name>RESERVED</name>		
				<description>Reserved</description>		
				<bitRange>[31:16]</bitRange>		

			</field>			
		</fields>				
	</register>					
	<register>					
		<name>DEVICE_ID</name>				
		<description>Device ID</description>				
		<addressOffset>0x3F4</addressOffset>				
		<access>read-only</access>				
		<resetValue>0</resetValue>				
		<resetMask>0x00000000</resetMask>				
		<fields>				
			<field>			
				<name>DEVICEID</name>		
				<description>Device ID numbers for LPC11Uxx parts LPC11U12FHN33/201 = 0x095C 802B/0x295C 802B LPC11U12FBD48/201 = 0x095C 802B/0x295C 802B LPC11U13FBD48/201 = 0x097A 802B/0x297A 802B LPC11U14FHN33/201 = 0x0998 802B/0x2998 802B LPC11U14FHI33/201 = 0x2998 802B LPC11U14FBD48/201 = 0x0998 802B/0x2998 802B LPC11U14FET48/201 = 0x0998 802B/0x2998 802B LPC11U23FBD48/301 = 0x2972 402B LPC11U24FHI33/301 = 0x2988 402B LPC11U24FBD48/301 = 0x2988 402B LPC11U24FET48/301 = 0x2988 402B LPC11U24FHN33/401 = 0x2980 002B LPC11U24FBD48/401 = 0x2980 002B LPC11U24FBD64/401 = 0x2980 002B</description>		
				<bitRange>[31:0]</bitRange>		
			</field>			
		</fields>				
	</register>					
</registers>						

</peripheral>

		<peripheral>
			<name>GPIO_PIN_INT</name>
			<description>GPIO pin interrupt </description>
			<groupName>GPIO_PIN_INT</groupName>
			<baseAddress>0x4004C000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>PIN_INT0</name>
				<value>0</value>
			</interrupt>
			<interrupt>
				<name>PIN_INT1</name>
				<value>1</value>
			</interrupt>
			<interrupt>
				<name>PIN_INT2</name>
				<value>2</value>
			</interrupt>
			<interrupt>
				<name>PIN_INT3</name>
				<value>3</value>
			</interrupt>
			<interrupt>
				<name>PIN_INT4</name>
				<value>4</value>
			</interrupt>
			<interrupt>
				<name>PIN_INT5</name>
				<value>5</value>
			</interrupt>
			<interrupt>
				<name>PIN_INT6</name>
				<value>6</value>
			</interrupt>
			<interrupt>
				<name>PIN_INT7</name>
				<value>7</value>
			</interrupt>
			<registers>
				<register>
					<name>ISEL</name>
					<description>Pin Interrupt Mode register</description>
					<addressOffset>0x000</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PMODE0</name>
							<description>Selects the interrupt mode for each pin interrupt. Bit n configures the pin interrupt selected in PINTSELn. 0 = Edge sensitive 1 = Level sensitive</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>PMODE1</name>
							<description>Selects the interrupt mode for each pin interrupt. Bit n configures the pin interrupt selected in PINTSELn. 0 = Edge sensitive 1 = Level sensitive</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>PMODE2</name>
							<description>Selects the interrupt mode for each pin interrupt. Bit n configures the pin interrupt selected in PINTSELn. 0 = Edge sensitive 1 = Level sensitive</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>PMODE3</name>
							<description>Selects the interrupt mode for each pin interrupt. Bit n configures the pin interrupt selected in PINTSELn. 0 = Edge sensitive 1 = Level sensitive</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>PMODE4</name>
							<description>Selects the interrupt mode for each pin interrupt. Bit n configures the pin interrupt selected in PINTSELn. 0 = Edge sensitive 1 = Level sensitive</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>PMODE5</name>
							<description>Selects the interrupt mode for each pin interrupt. Bit n configures the pin interrupt selected in PINTSELn. 0 = Edge sensitive 1 = Level sensitive</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>PMODE6</name>
							<description>Selects the interrupt mode for each pin interrupt. Bit n configures the pin interrupt selected in PINTSELn. 0 = Edge sensitive 1 = Level sensitive</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>PMODE7</name>
							<description>Selects the interrupt mode for each pin interrupt. Bit n configures the pin interrupt selected in PINTSELn. 0 = Edge sensitive 1 = Level sensitive</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>IENR</name>
					<description>Pin Interrupt Enable (Rising) register</description>
					<addressOffset>0x004</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ENRL0</name>
							<description>Enables the rising edge or level interrupt for each pin interrupt. Bit n configures the pin interrupt selected in PINTSELn. 0 = Disable rising edge or level interrupt. 1 = Enable rising edge or level interrupt.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>ENRL1</name>
							<description>Enables the rising edge or level interrupt for each pin interrupt. Bit n configures the pin interrupt selected in PINTSELn. 0 = Disable rising edge or level interrupt. 1 = Enable rising edge or level interrupt.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>ENRL2</name>
							<description>Enables the rising edge or level interrupt for each pin interrupt. Bit n configures the pin interrupt selected in PINTSELn. 0 = Disable rising edge or level interrupt. 1 = Enable rising edge or level interrupt.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>ENRL3</name>
							<description>Enables the rising edge or level interrupt for each pin interrupt. Bit n configures the pin interrupt selected in PINTSELn. 0 = Disable rising edge or level interrupt. 1 = Enable rising edge or level interrupt.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>ENRL4</name>
							<description>Enables the rising edge or level interrupt for each pin interrupt. Bit n configures the pin interrupt selected in PINTSELn. 0 = Disable rising edge or level interrupt. 1 = Enable rising edge or level interrupt.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>ENRL5</name>
							<description>Enables the rising edge or level interrupt for each pin interrupt. Bit n configures the pin interrupt selected in PINTSELn. 0 = Disable rising edge or level interrupt. 1 = Enable rising edge or level interrupt.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>ENRL6</name>
							<description>Enables the rising edge or level interrupt for each pin interrupt. Bit n configures the pin interrupt selected in PINTSELn. 0 = Disable rising edge or level interrupt. 1 = Enable rising edge or level interrupt.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>ENRL7</name>
							<description>Enables the rising edge or level interrupt for each pin interrupt. Bit n configures the pin interrupt selected in PINTSELn. 0 = Disable rising edge or level interrupt. 1 = Enable rising edge or level interrupt.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>SIENR</name>
					<description>Set Pin Interrupt Enable (Rising) register</description>
					<addressOffset>0x008</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>SETENRL0</name>
							<description>Ones written to this address set bits in the PINTEN_R, thus enabling interrupts. Bit n sets bit n in the PINTEN_R register. 0 = No operation. 1 = Enable rising edge or level interrupt.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>SETENRL1</name>
							<description>Ones written to this address set bits in the PINTEN_R, thus enabling interrupts. Bit n sets bit n in the PINTEN_R register. 0 = No operation. 1 = Enable rising edge or level interrupt.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>SETENRL2</name>
							<description>Ones written to this address set bits in the PINTEN_R, thus enabling interrupts. Bit n sets bit n in the PINTEN_R register. 0 = No operation. 1 = Enable rising edge or level interrupt.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>SETENRL3</name>
							<description>Ones written to this address set bits in the PINTEN_R, thus enabling interrupts. Bit n sets bit n in the PINTEN_R register. 0 = No operation. 1 = Enable rising edge or level interrupt.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>SETENRL4</name>
							<description>Ones written to this address set bits in the PINTEN_R, thus enabling interrupts. Bit n sets bit n in the PINTEN_R register. 0 = No operation. 1 = Enable rising edge or level interrupt.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>SETENRL5</name>
							<description>Ones written to this address set bits in the PINTEN_R, thus enabling interrupts. Bit n sets bit n in the PINTEN_R register. 0 = No operation. 1 = Enable rising edge or level interrupt.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>SETENRL6</name>
							<description>Ones written to this address set bits in the PINTEN_R, thus enabling interrupts. Bit n sets bit n in the PINTEN_R register. 0 = No operation. 1 = Enable rising edge or level interrupt.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>SETENRL7</name>
							<description>Ones written to this address set bits in the PINTEN_R, thus enabling interrupts. Bit n sets bit n in the PINTEN_R register. 0 = No operation. 1 = Enable rising edge or level interrupt.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>CIENR</name>
					<description>Clear Pin Interrupt Enable (Rising) register</description>
					<addressOffset>0x00C</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>CENRL0</name>
							<description>Ones written to this address clear bits in the IENR, thus disabling the interrupts. Bit n clears bit n in the IENR register. 0 = No operation. 1 = Disable rising edge or level interrupt.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>CENRL1</name>
							<description>Ones written to this address clear bits in the IENR, thus disabling the interrupts. Bit n clears bit n in the IENR register. 0 = No operation. 1 = Disable rising edge or level interrupt.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>CENRL2</name>
							<description>Ones written to this address clear bits in the IENR, thus disabling the interrupts. Bit n clears bit n in the IENR register. 0 = No operation. 1 = Disable rising edge or level interrupt.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>CENRL3</name>
							<description>Ones written to this address clear bits in the IENR, thus disabling the interrupts. Bit n clears bit n in the IENR register. 0 = No operation. 1 = Disable rising edge or level interrupt.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>CENRL4</name>
							<description>Ones written to this address clear bits in the IENR, thus disabling the interrupts. Bit n clears bit n in the IENR register. 0 = No operation. 1 = Disable rising edge or level interrupt.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>CENRL5</name>
							<description>Ones written to this address clear bits in the IENR, thus disabling the interrupts. Bit n clears bit n in the IENR register. 0 = No operation. 1 = Disable rising edge or level interrupt.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>CENRL6</name>
							<description>Ones written to this address clear bits in the IENR, thus disabling the interrupts. Bit n clears bit n in the IENR register. 0 = No operation. 1 = Disable rising edge or level interrupt.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>CENRL7</name>
							<description>Ones written to this address clear bits in the IENR, thus disabling the interrupts. Bit n clears bit n in the IENR register. 0 = No operation. 1 = Disable rising edge or level interrupt.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>IENF</name>
					<description>Pin Interrupt Enable Falling Edge / Active Level register</description>
					<addressOffset>0x010</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ENAF0</name>
							<description>Enables the falling edge or configures the active level interrupt for each pin interrupt. Bit n configures the pin interrupt selected in PINTSELn. 0 = Disable falling edge interrupt or set active interrupt level LOW. 1 = Enable falling edge interrupt enabled or set active interrupt level HIGH.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>ENAF1</name>
							<description>Enables the falling edge or configures the active level interrupt for each pin interrupt. Bit n configures the pin interrupt selected in PINTSELn. 0 = Disable falling edge interrupt or set active interrupt level LOW. 1 = Enable falling edge interrupt enabled or set active interrupt level HIGH.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>ENAF2</name>
							<description>Enables the falling edge or configures the active level interrupt for each pin interrupt. Bit n configures the pin interrupt selected in PINTSELn. 0 = Disable falling edge interrupt or set active interrupt level LOW. 1 = Enable falling edge interrupt enabled or set active interrupt level HIGH.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>ENAF3</name>
							<description>Enables the falling edge or configures the active level interrupt for each pin interrupt. Bit n configures the pin interrupt selected in PINTSELn. 0 = Disable falling edge interrupt or set active interrupt level LOW. 1 = Enable falling edge interrupt enabled or set active interrupt level HIGH.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>ENAF4</name>
							<description>Enables the falling edge or configures the active level interrupt for each pin interrupt. Bit n configures the pin interrupt selected in PINTSELn. 0 = Disable falling edge interrupt or set active interrupt level LOW. 1 = Enable falling edge interrupt enabled or set active interrupt level HIGH.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>ENAF5</name>
							<description>Enables the falling edge or configures the active level interrupt for each pin interrupt. Bit n configures the pin interrupt selected in PINTSELn. 0 = Disable falling edge interrupt or set active interrupt level LOW. 1 = Enable falling edge interrupt enabled or set active interrupt level HIGH.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>ENAF6</name>
							<description>Enables the falling edge or configures the active level interrupt for each pin interrupt. Bit n configures the pin interrupt selected in PINTSELn. 0 = Disable falling edge interrupt or set active interrupt level LOW. 1 = Enable falling edge interrupt enabled or set active interrupt level HIGH.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>ENAF7</name>
							<description>Enables the falling edge or configures the active level interrupt for each pin interrupt. Bit n configures the pin interrupt selected in PINTSELn. 0 = Disable falling edge interrupt or set active interrupt level LOW. 1 = Enable falling edge interrupt enabled or set active interrupt level HIGH.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>SIENF</name>
					<description>Set Pin Interrupt Enable Falling Edge / Active Level register</description>
					<addressOffset>0x014</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>SETENAF0</name>
							<description>Ones written to this address set bits in the IENF, thus enabling interrupts. Bit n sets bit n in the IENF register. 0 = No operation. 1 = Select HIGH-active interrupt or enable falling edge interrupt.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>SETENAF1</name>
							<description>Ones written to this address set bits in the IENF, thus enabling interrupts. Bit n sets bit n in the IENF register. 0 = No operation. 1 = Select HIGH-active interrupt or enable falling edge interrupt.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>SETENAF2</name>
							<description>Ones written to this address set bits in the IENF, thus enabling interrupts. Bit n sets bit n in the IENF register. 0 = No operation. 1 = Select HIGH-active interrupt or enable falling edge interrupt.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>SETENAF3</name>
							<description>Ones written to this address set bits in the IENF, thus enabling interrupts. Bit n sets bit n in the IENF register. 0 = No operation. 1 = Select HIGH-active interrupt or enable falling edge interrupt.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>SETENAF4</name>
							<description>Ones written to this address set bits in the IENF, thus enabling interrupts. Bit n sets bit n in the IENF register. 0 = No operation. 1 = Select HIGH-active interrupt or enable falling edge interrupt.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>SETENAF5</name>
							<description>Ones written to this address set bits in the IENF, thus enabling interrupts. Bit n sets bit n in the IENF register. 0 = No operation. 1 = Select HIGH-active interrupt or enable falling edge interrupt.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>SETENAF6</name>
							<description>Ones written to this address set bits in the IENF, thus enabling interrupts. Bit n sets bit n in the IENF register. 0 = No operation. 1 = Select HIGH-active interrupt or enable falling edge interrupt.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>SETENAF7</name>
							<description>Ones written to this address set bits in the IENF, thus enabling interrupts. Bit n sets bit n in the IENF register. 0 = No operation. 1 = Select HIGH-active interrupt or enable falling edge interrupt.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
