pyocd/pyOCD/pyocd/debug/svd/data/LPC11Uxx_v7.svd
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:16]</bitRange>

				</field>
			</fields>
		</register>
		<register>
			<name>EPLISTSTART</name>
			<description>USB EP Command/Status List start address</description>
			<addressOffset>0x008</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[7:0]</bitRange>
				</field>
				<field>
					<name>EP_LIST</name>
					<description>Start address of the USB EP Command/Status List.</description>
					<bitRange>[31:8]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>DATABUFSTART</name>
			<description>USB Data buffer start address</description>
			<addressOffset>0x00C</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[21:0]</bitRange>
				</field>
				<field>
					<name>DA_BUF</name>
					<description>Start address of the buffer pointer page where all endpoint data buffers are located.</description>
					<bitRange>[31:22]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>LPM</name>
			<description>Link Power Management register</description>
			<addressOffset>0x010</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>HIRD_HW</name>
					<description>Host Initiated Resume Duration - HW. This is the HIRD value from the last received LPM token</description>
					<bitRange>[3:0]</bitRange>
				</field>
				<field>
					<name>HIRD_SW</name>
					<description>Host Initiated Resume Duration - SW. This is the time duration required by the USB device system to come out of LPM initiated suspend after receiving the host initiated LPM resume.</description>
					<bitRange>[7:4]</bitRange>
				</field>
				<field>
					<name>DATA_PENDING</name>
					<description>As long as this bit is set to one and LPM supported bit is set to one, HW will return a NYET handshake on every LPM token it receives. If LPM supported bit is set to one and this bit is zero, HW will return an ACK handshake on every LPM token it receives. If SW has still data pending and LPM is supported, it must set this bit to 1.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:9]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>EPSKIP</name>
			<description>USB Endpoint skip</description>
			<addressOffset>0x014</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>SKIP</name>
					<description>Endpoint skip: Writing 1 to one of these bits, will indicate to HW that it must deactivate the buffer assigned to this endpoint and return control back to software. When HW has deactivated the endpoint, it will clear this bit, but it will not modify the EPINUSE bit.  An interrupt will be generated when the Active bit goes from 1 to 0.  Note: In case of double-buffering, HW will only clear the Active bit of the buffer indicated by the EPINUSE bit.</description>
					<bitRange>[29:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:30]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>EPINUSE</name>
			<description>USB Endpoint Buffer in use</description>
			<addressOffset>0x018</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Fixed to zero because the control endpoint zero is fixed to single-buffering for each physical endpoint.</description>
					<bitRange>[1:0]</bitRange>
				</field>
				<field>
					<name>BUF</name>
					<description>Buffer in use: This register has one bit per physical endpoint.  0: HW is accessing buffer 0.  1: HW is accessing buffer 1.</description>
					<bitRange>[9:2]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:10]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>EPBUFCFG</name>
			<description>USB Endpoint Buffer Configuration register</description>
			<addressOffset>0x01C</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Fixed to zero because the control endpoint zero is fixed to single-buffering for each physical endpoint.</description>
					<bitRange>[1:0]</bitRange>
				</field>
				<field>
					<name>BUF_SB</name>
					<description>Buffer usage: This register has one bit per physical endpoint. 0: Single-buffer.  1: Double-buffer. If the bit is set to single-buffer (0), it will not toggle the corresponding EPINUSE bit when it clears the active bit. If the bit is set to double-buffer (1), HW will toggle the EPINUSE bit when it clears the Active bit for the buffer.</description>
					<bitRange>[9:2]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:10]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>INTSTAT</name>
			<description>USB interrupt status register</description>
			<addressOffset>0x020</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>EP0OUT</name>
					<description>Interrupt status register bit for the Control EP0 OUT direction.  This bit will be set if NBytes transitions to zero or the skip bit is set by software or a SETUP packet is successfully received for the control EP0. If the IntOnNAK_CO is set, this bit will also be set when a NAK is transmitted for the Control EP0 OUT direction.  Software can clear this bit by writing a one to it.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>EP0IN</name>
					<description>Interrupt status register bit for the Control EP0 IN direction.  This bit will be set if NBytes transitions to zero or the skip bit is set by software.  If the IntOnNAK_CI is set, this bit will also be set when a NAK is transmitted for the Control EP0 IN direction.  Software can clear this bit by writing a one to it.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>EP1OUT</name>
					<description>Interrupt status register bit for the EP1 OUT direction. This bit will be set if the corresponding Active bit is cleared by HW. This is done in case the programmed NBytes transitions to zero or the skip bit is set by software.  If the IntOnNAK_AO is set, this bit will also be set when a NAK is transmitted for the EP1 OUT direction.  Software can clear this bit by writing a one to it.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>EP1IN</name>
					<description>Interrupt status register bit for the EP1 IN direction.  This bit will be set if the corresponding Active bit is cleared by HW. This is done in case the programmed NBytes transitions to zero or the skip bit is set by software.  If the IntOnNAK_AI is set, this bit will also be set when a NAK is transmitted for the EP1 IN direction.  Software can clear this bit by writing a one to it.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>EP2OUT</name>
					<description>Interrupt status register bit for the EP2 OUT direction.  This bit will be set if the corresponding Active bit is cleared by HW. This is done in case the programmed NBytes transitions to zero or the skip bit is set by software.  If the IntOnNAK_AO is set, this bit will also be set when a NAK is transmitted for the EP2 OUT direction.  Software can clear this bit by writing a one to it.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>EP2IN</name>
					<description>Interrupt status register bit for the EP2 IN direction.  This bit will be set if the corresponding Active bit is cleared by HW. This is done in case the programmed NBytes transitions to zero or the skip bit is set by software.  If the IntOnNAK_AI is set, this bit will also be set when a NAK is transmitted for the EP2 IN direction.  Software can clear this bit by writing a one to it.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>EP3OUT</name>
					<description>Interrupt status register bit for the EP3 OUT direction.  This bit will be set if the corresponding Active bit is cleared by HW. This is done in case the programmed NBytes transitions to zero or the skip bit is set by software.  If the IntOnNAK_AO is set, this bit will also be set when a NAK is transmitted for the EP3 OUT direction.  Software can clear this bit by writing a one to it.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>EP3IN</name>
					<description>Interrupt status register bit for the EP3 IN direction.  This bit will be set if the corresponding Active bit is cleared by HW. This is done in case the programmed NBytes transitions to zero or the skip bit is set by software.  If the IntOnNAK_AI is set, this bit will also be set when a NAK is transmitted for the EP3 IN direction.  Software can clear this bit by writing a one to it.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>EP4OUT</name>
					<description>Interrupt status register bit for the EP4 OUT direction.  This bit will be set if the corresponding Active bit is cleared by HW. This is done in case the programmed NBytes transitions to zero or the skip bit is set by software.  If the IntOnNAK_AO is set, this bit will also be set when a NAK is transmitted for the EP4 OUT direction.  Software can clear this bit by writing a one to it.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>EP4IN</name>
					<description>Interrupt status register bit for the EP4 IN direction.  This bit will be set if the corresponding Active bit is cleared by HW. This is done in case the programmed NBytes transitions to zero or the skip bit is set by software.  If the IntOnNAK_AI is set, this bit will also be set when a NAK is transmitted for the EP4 IN direction.  Software can clear this bit by writing a one to it.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[29:10]</bitRange>
				</field>
				<field>
					<name>FRAME_INT</name>
					<description>Frame interrupt.  This bit is set to one every millisecond when the VbusDebounced bit and the DCON bit are set. This bit can be used by software when handling isochronous endpoints.  Software can clear this bit by writing a one to it.</description>
					<bitRange>[30:30]</bitRange>
				</field>
				<field>
					<name>DEV_INT</name>
					<description>Device status interrupt. This bit is set by HW when one of the bits in the Device Status Change register are set. Software can clear this bit by writing a one to it.</description>
					<bitRange>[31:31]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>INTEN</name>
			<description>USB interrupt enable register</description>
			<addressOffset>0x024</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>EP_INT_EN</name>
					<description>If this bit is set and the corresponding USB interrupt status bit is set, a HW interrupt is generated on the interrupt line indicated by the corresponding USB interrupt routing bit.</description>
					<bitRange>[9:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[29:10]</bitRange>
				</field>
				<field>
					<name>FRAME_INT_EN</name>
					<description>If this bit is set and the corresponding USB interrupt status bit is set, a HW interrupt is generated on the interrupt line indicated by the corresponding USB interrupt routing bit.</description>
					<bitRange>[30:30]</bitRange>
				</field>
				<field>
					<name>DEV_INT_EN</name>
					<description>If this bit is set and the corresponding USB interrupt status bit is set, a HW interrupt is generated on the interrupt line indicated by the corresponding USB interrupt routing bit.</description>
					<bitRange>[31:31]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>INTSETSTAT</name>
			<description>USB set interrupt status register</description>
			<addressOffset>0x028</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>EP_SET_INT</name>
					<description>If software writes a one to one of these bits, the corresponding USB interrupt status bit is set.  When this register is read, the same value as the USB interrupt status register is returned.</description>
					<bitRange>[9:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[29:10]</bitRange>
				</field>
				<field>
					<name>FRAME_SET_INT</name>
					<description>If software writes a one to one of these bits, the corresponding USB interrupt status bit is set.  When this register is read, the same value as the USB interrupt status register is returned.</description>
					<bitRange>[30:30]</bitRange>
				</field>
				<field>
					<name>DEV_SET_INT</name>
					<description>If software writes a one to one of these bits, the corresponding USB interrupt status bit is set.  When this register is read, the same value as the USB interrupt status register is returned.</description>
					<bitRange>[31:31]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>INTROUTING</name>
			<description>USB interrupt routing register</description>
			<addressOffset>0x02C</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>ROUTE_INT9_0</name>
					<description>This bit can control on which hardware interrupt line the interrupt will be generated:  0: IRQ interrupt line is selected for this interrupt bit 1: FIQ interrupt line is selected for this interrupt bit</description>
					<bitRange>[9:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[29:10]</bitRange>
				</field>
				<field>
					<name>ROUTE_INT30</name>
					<description>This bit can control on which hardware interrupt line the interrupt will be generated:  0: IRQ interrupt line is selected for this interrupt bit 1: FIQ interrupt line is selected for this interrupt bit</description>
					<bitRange>[30:30]</bitRange>
				</field>
				<field>
					<name>ROUTE_INT31</name>
					<description>This bit can control on which hardware interrupt line the interrupt will be generated:  0: IRQ interrupt line is selected for this interrupt bit 1: FIQ interrupt line is selected for this interrupt bit</description>
					<bitRange>[31:31]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>EPTOGGLE</name>
			<description>USB Endpoint toggle register</description>
			<addressOffset>0x034</addressOffset>
			<access>read-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>TOGGLE</name>
					<description>Endpoint data toggle: This field indicates the current value of the data toggle for the corresponding endpoint.</description>
					<bitRange>[9:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:10]</bitRange>
				</field>
			</fields>
		</register>
